---
kind: property
id: P:Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.DivisionGap
source: html/c4ca59b9-8b0a-a57c-5eff-e2e6ec71fb40.htm
---
# Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.DivisionGap Property

The gap which is created between matching profiles of parts.

## Syntax (C#)
```csharp
public double DivisionGap { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for divisionGap must be between 0 and 30000 feet.